Клиент_семейного_бюджета/src/Catalogs/СемейныйЧат/СемейныйЧат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СемейныйЧат</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Клиент_семейного_бюджета/src/Catalogs/СемейныйЧат/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура УстановитьИзображение(Адрес, Расширение)
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	СпрОбъект.ДанныеСообщения = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	ЗначениеВРеквизитФормы(СпрОбъект, "Объект");
	УдалитьИзВременногоХранилища(Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзображение()
	
	Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеСообщения");
	Элементы.Картинка.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			Фотоснимок = СредстваМультимедиа.СделатьФотоснимок( , , 90);
			Если Фотоснимок <> Неопределено Тогда
				Адрес = ПоместитьВоВременноеХранилище(Фотоснимок.ПолучитьДвоичныеДанные());
				УстановитьИзображение(Адрес, Фотоснимок.РасширениеФайла);
				ПоказатьИзображение();
			КонецЕсли; 
		Иначе
			Предупреждение("Фотоснимок не поддерживается!");
		КонецЕсли;
	#Иначе
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = ""; 
		Диалог.МножественныйВыбор = Ложь; 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
		Диалог.Показать(ОписаниеОповещения);
		
	#КонецЕсли
	
КонецПроцедуры  

Процедура Видеозапись()
	
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяВидеозапись() Тогда
			Видеозапись = СредстваМультимедиа.СделатьВидеозапись(, КачествоВидеозаписи.Высокое);
			Если Видеозапись <> Неопределено Тогда
				ДД = Видеозапись.ПолучитьДвоичныеДанные();
				Адрес = ПоместитьВоВременноеХранилище(ДД);
			КонецЕсли; 
		Иначе
			Предупреждение("Видеозапись не поддерживается!");
		КонецЕсли;	
	#КонецЕсли
	
КонецПроцедуры
	
&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт  
	
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор);  
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	СсылкаНаКартинку = Адрес;
	ПослеПомещенияФайлНаСервере(СсылкаНаКартинку);
	
КонецПроцедуры

&НаСервере
Процедура ПослеПомещенияФайлНаСервере(СсылкаНаКартинку)
	
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда
		СпрОбъект = РеквизитФормыВЗначение("Объект");
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		СпрОбъект.ДанныеСообщения = Новый ХранилищеЗначения(ФайлКартинки); 
		СпрОбъект.Записать();
		ЗначениеВРеквизитФормы(СпрОбъект, "Объект");
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДанныеСообщения"); 		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДанныеСообщения");
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПользователь = Константы.ТекущийПользователь.Получить();
		Если ТекПользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
			Объект.Пользователь = ТекПользователь;
		КонецЕсли;   
		Период = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
